{
  "name": "Borscht Борщ",
  "category": "Untested",
  "description": "",
  "prepTime": "15 minutes",
  "cookTime": "30 minutes",
  "image": "",
  "ingredients": [
    "2 large beets (apple size), or 4 small ones",
    "1 large carrot (or 2 small ones)",
    "1 small red onion",
    "1/2 head of small green cabbage (use 1/3 if it's a big one)",
    "2 small red bliss potatoes",
    "1 pint cherry tomatoes",
    "10-12 cups water (start with less at first, and you can add more if the soup looks too dense once you combine all the ingredients)",
    "ketchup - 4 generous squirts (maybe more to taste)",
    "12 cloves of garlic, peeled but kept whole",
    "3 bay leaves",
    "crushed black pepper (a few turns of pepper mill)",
    "salt (to taste, maybe 1/2 teaspoon?)",
    "1/2 cup fresh parsley",
    "1/2 bunch scallions, whole (ends just a bit trimmed)",
    "dry parsley - 8 shakes of spice bottle",
    "dry dill - 8 shakes, same as dill",
    "cayenne pepper - 1-2 shakes (1/2 teaspoon maybe?  go slow, very spicy!)",
    "1 tablespoon olive oil",
    "For serving:",
    "sour cream",
    "cayenne",
    "fresh dill (finely chopped)",
    "Bread",
    "Vidalia onion",
    "fresh scallions",
    "coarse salt"
  ],
  "instructions": [
    "Mise en Place:",
    "Peel and Shred the Beets with a medium-holed grater",
    "Peel and Shred the Carrots",
    "Peel and Slice Thin the Red Onion",
    "Peel and Slice Thin the Cabbage",
    "Cube the Potatoes (but do not peel)",
    "Measure out ½ cup parsley and finely chop it",
    "Finely chop the dill (enough for the amount being served)",
    "In a large Dutch Oven,  add water and shredded cabbage, cover the lid, and bring to a boil.",
    "meanwhile, in a large searing pan, add 1 tablespoon olive oil, shredded beets, shredded carrots, sliced red onion, and 4 generous squirts of ketchup, mix well, and sautee on medium heat for 15-20 minutes.",
    "Once the water and cabbage are brought to a boil, turn down the heat, add the beet mixture from pan, potatoes, garlic, bay leaves, black pepper, salt, dry parsley, and dry dill.  (Add more water here if necessary, but probably you will not need to.)  Mix well and bring everything to a simmer with the lid open.  Within a few minutes you will see foam start to form on top - monitor the soup and gently remove as much of this foam as possible over the next 10-15 minutes as everything cooks.",
    "Once the foam subsides, add the fresh parsley, mix well, and then add the half bunch of scallions (uncut) - just place it on the top surface of the soup and submerge it a bit and let it hang out there.",
    "Simmer on medium-low with the lid slightly ajar for about an hour.",
    "Taste and correct seasonings (More ketchup?  Quite possibly so!)  Add the tiny bit of cayenne and cherry tomatoes.",
    "Cook another 10-15 minutes on medium-low heat.  (You could remove the whole scallions once soup is done, but I would just keep them in there to keep building flavor for leftovers - just do not serve them.)",
    "To serve - ladle soup into bowls, top with a tiny pinch of cayenne (optional - give your guests a heads up as this is not traditional at all), a dollop of sour cream and a generous pinch of fresh dill.  Serve with rye and/or pumpernickel bread, and wedges of Vidalia onion and whole scallions arranged around a little bowl of salt for dipping (onion and scallion.)"
  ],
  "dateAdded": "2025-12-05T17:17:52.649Z"
}