{
  "name": "Buttermilk Biscuits",
  "category": "Baked Goods",
  "description": "Flaky, tender buttermilk biscuits with a golden crust, perfect for breakfast or as a side.",
  "prepTime": "15 minutes",
  "cookTime": "30 minutes",
  "image": "",
  "ingredients": [
    "240g all-purpose flour (2 cups)",
    "1 teaspoon sugar",
    "1 tablespoon baking powder",
    "1 teaspoon salt plus extra for seasoning",
    "¼ pound butter, cubed, cold",
    "¾ cup buttermilk",
    "~2 Tablespoons honey, Warmed (optional)",
    "Equipment",
    "Food processor",
    "Dough Cutter",
    "Spatula",
    "Rolling pin",
    "3in round cutter",
    "Large mixing bowl",
    "Half size baking sheet",
    "Parchment paper",
    "Weigh 240g flour and put into food processor. Leave flour container out for dusting.",
    "Measure 1 teaspoon salt and put into food processor.",
    "Measure 1 teaspoon sugar and put into food processor.",
    "Measure 1 Tablespoon baking powder and put into food processor.",
    "Measure ¾ cup buttermilk in a liquid measuring cup. Leave in cup",
    "Measure honey in ramekin"
  ],
  "instructions": [
    "Mise en Place:",
    "Butter",
    "Using a dough cutter cut a stick of butter lengthwise into thirds.",
    "Turn the butter 90degrees and cut again into thirds.",
    "Starting on one side, cut the butter into ½ slices.",
    "Put butter into ramekin and keep in refrigerator until ready to use.",
    "Preheat the oven to 350°. Convention if possible.",
    "Pulse dry ingredients in food processor 2-3 times.",
    "Pulse the flour in a food processor with the cold butter until the butter is the size of small pebbles approx 6-8 times.",
    "Move food processor mixture into a large bowl.",
    "Fold in the buttermilk using a spatula until mixed.",
    "Dust a counter with the flour as well as your hands, the rolling pin and the dough cutter.",
    "Transfer the dough to the counter and gently knead the dough until a rollable ball is created.",
    "Roll the dough so it is ¾ inch high.",
    "Cut the dough with a large floured biscuit cutter.",
    "Knead scraps to make the final 2 biscuits.",
    "Place the pieces 1½ inches apart on a lined sheet tray.",
    "Bake for 12 minutes",
    "Rotate the sheet tray and bake for another 12 minutes.",
    "Warm up honey in microwave for 20 seconds",
    "Brush biscuits with honey and season with salt"
  ],
  "dateAdded": "2025-12-05T17:18:28.448Z"
}