{
  "name": "Charcoal-Grilled Al Pastor Skewers",
  "category": "Grilling",
  "description": "",
  "prepTime": "15 minutes",
  "cookTime": "TOTAL TIME:",
  "image": "",
  "ingredients": [
    "For the Pork:",
    "2 ancho chilies (40g), stemmed and seeded",
    "2 pasilla or guajillo chilies (15g), stemmed and seeded",
    "1/2 cup (120ml) homemade chicken stock or low-sodium store-bought broth",
    "2 teaspoons (10ml) vegetable oil",
    "1 teaspoon (2g) dried Mexican oregano",
    "1 teaspoon (3g) ground cumin",
    "1 tablespoon (12g) achiote powder or paste",
    "1 chipotle chili in adobo (15g), plus 2 teaspoons (10ml) adobo sauce",
    "1/4 cup (60ml) distilled white vinegar",
    "2 1/2 teaspoons (10g) kosher salt",
    "2 teaspoons (10g) sugar",
    "3 medium garlic cloves (15g)",
    "2 pounds (900g) pork butt, in one piece",
    "For the Skewers and Serving:",
    "1 small pineapple (around 2 pounds; 900g), peeled, cored, and cut into 1- by 1/4-inch pieces",
    "Lime wedges, for serving",
    "Finely chopped fresh cilantro leaves and tender stems (optional)",
    "Salsa verde, for serving (optional)"
  ],
  "instructions": [
    "Mise en Place:",
    "Marinade",
    "Remove the stem and seed of 2 ancho chilies (40g).",
    "Remove the stem and seed 2 pasilla or guajillo chilies (15g).",
    "Measure 1/2 cup (120ml) chicken stock or low-sodium store-bought broth.",
    "Measue 1 Tbsp of Achiote Paste and put into small bowl.",
    "Measure 1 Tsp of Mexican Oregano and put into Achiote bowl.",
    "Measure 1 Tsp of ground cumin and put into Achiote bowl.",
    "Measure 2½ Tsp of salt and put into small bowl.",
    "Measure 2 Tsp of sugar and put into salt bowl.",
    "Measure ¼ cup distilled white vinegar.",
    "Open a can of chipoltle chili in adobo and remove 1 chili and 2Tsp of sauce in small bowl.",
    "Peel and halve 3 cloves of garlic and put into small bowl.",
    "Pork",
    "Freeze pork for 15 minutes and up to 30 minutes (partially freezing the pork makes it easier to slice).",
    "Using a sharp chef's knife or slicing knife, slice pork against the grain into 2-inch-long, 1-inch-wide, and 1/8-inch-thick strips.",
    "Marinade",
    "In a large, dry saucepan, toast ancho and pasilla chilies over medium-high heat, turning chilies occasionally, until puffed, pliable, lightly browned in spots, and very aromatic, about 5 minutes.",
    "Add chicken stock (it should boil immediately), then pour contents of saucepan into a small heatproof bowl.",
    "Cover loosely with plastic wrap and set aside.",
    "Wipe out saucepan, add oil, and return to medium-high heat until oil is shimmering.",
    "Add cumin, oregano, and achiote and cook, stirring frequently, until spices are bloomed and aromatic but not browned, about 30 seconds.",
    "Stir in chipotle and adobo sauce and cook for 30 seconds longer.",
    "Stir in vinegar, salt, and sugar, and remove saucepan from heat.",
    "Transfer contents of saucepan to a blender along with garlic and chilies with their steeping liquid. Blend on high speed until completely smooth, scraping down sides of blender jar with a rubber spatula as needed, about 1 minute. Set aside.",
    "Combine pork and marinade in a large bowl, and using hands, toss until every piece of meat is evenly coated in marinade.",
    "Cover tightly with plastic wrap and refrigerate for at least 4 hours and up to 36 hours.",
    "Grilling",
    "Thread one piece of pork onto a skewer, piercing it through twice to secure it, then bunching meat tightly together like an accordion.",
    "Thread one piece of pineapple onto skewer.",
    "Continue alternating pieces of pork with pineapple, ending the skewer with a piece of pork.",
    "Repeat skewering process with remaining pork and pineapple.",
    "Place skewers directly over the hot coals, balancing them on top of the bricks, with the handles overhanging the bricks closest to you, and the tips balancing on the farther wall of bricks.",
    "Cook, turning frequently, until pork and pineapple are lightly charred, and a piece of pork looks cooked through when removed and cut in half, 8 to 10 minutes.",
    "Transfer to serving platter and let rest for 1 to 2 minutes.",
    "Serve immediately, passing lime wedges, as well as cilantro and salsa (if using), at the table."
  ],
  "dateAdded": "2025-12-05T17:17:07.530Z"
}