{
  "name": "Cherry Biscuit Cobbler",
  "category": "Untested",
  "description": "A rustic dessert with sweet cherries topped with lemon-scented biscuit dough and baked until golden.",
  "prepTime": "15 minutes",
  "cookTime": "30 minutes",
  "image": "",
  "ingredients": [
    "Biscuits",
    "¼ cup granulated sugar",
    "1 Tbsp. baking powder",
    "2 tsp. finely grated lemon zest",
    "1 tsp. kosher salt",
    "2 cups all-purpose flour, plus more for surface",
    "½ cup (1 stick) chilled unsalted butter, cut into pieces",
    "1⅓ cups chilled heavy cream",
    "Filling and Assembly",
    "2 lb. fresh (or frozen) sweet cherries, pitted",
    "½ cup granulated sugar",
    "¼ cup fresh lemon juice",
    "3 Tbsp. cornstarch",
    "½ tsp. ground cinnamon",
    "1 tsp. vanilla extract",
    "¼ tsp. almond extract",
    "¼ tsp. kosher salt",
    "3 Tbsp. unsalted butter, melted, slightly cooled",
    "2 Tbsp. raw sugar",
    "Vanilla ice cream or softly whipped cream (for serving)",
    "Special Equipment",
    "A 1½\"-diameter cookie cutter"
  ],
  "instructions": [
    "Biscuits",
    "Whisk granulated sugar, baking powder, lemon zest, salt, and 2 cups flour in a medium bowl.",
    "Pulse the flour in a food processor with the cold butter until the butter is the size of small pebbles. Empty into large bowl",
    "Gradually stream cream into bowl, tossing flour mixture constantly with a fork to distribute. Using a flexible bench scraper or a hard plastic spatula, fold dough over and onto itself several times, scraping bottom and sides of the bowl, to bring together into a mass (dough will feel very wet and sticky).",
    "Turn out dough onto a generously floured surface. Pat into a ¾\"-thick rectangle or square with floured hands, using bench scraper or spatula to lift up dough and dust underneath with more flour as needed to prevent sticking. Dust surface with more flour, then cut dough into 4 equal pieces and stack on top of each other. Dust with flour and press down on stack with a rolling pin to flatten to a workable height. Roll out to ½\" thick, dusting with more flour as needed.",
    "Use cutter to punch out biscuits as closely as possible, dipping cutter in flour often. Transfer biscuits to a plate. You should have about 40. Gather up dough scraps, reroll, and punch out more biscuits if needed. Chill until ready to use.",
    "Do Ahead: Dough can be made 1 day ahead; wrap tightly and chill.",
    "Filling and Assembly",
    "Place a rack in middle of oven and preheat to 400°.",
    "Mix cherries, granulated sugar, lemon juice, cornstarch, cinnamon, vanilla extract, almond extract, and salt in a large bowl.",
    "Scrape filling into a 2-qt. baking dish or 9\"-diameter cake pan with 2\" sides and press down on it firmly to compact.",
    "Place on a foil-lined baking sheet.",
    "Arrange chilled biscuits over filling, fitting snugly so they’re touching with only a few gaps.",
    "Brush generously with butter; sprinkle with raw sugar.",
    "Bake cobbler 10 minutes.",
    "Reduce heat to 350° and continue to bake until biscuits are golden brown and juices are bubbling, 50–65 minutes more.",
    "Let cool slightly.",
    "Serve cobbler with ice cream.",
    "Do Ahead: Cobbler can be baked 1 day ahead; store tightly covered at room temperature."
  ],
  "dateAdded": "2025-12-05T17:17:45.246Z"
}