{
  "name": "Kimchi and Bacon Fried Rice",
  "category": "Rice Dishes",
  "description": "A flavorful Korean-inspired fried rice with crispy bacon, kimchi, and topped with a fried egg.",
  "prepTime": "15 minutes",
  "cookTime": "45 minutes (plus the time to cook the rice)",
  "image": "",
  "ingredients": [
    "3 ¼ cups cooked Japanese-style short-grain rice, preferably chilled",
    "6-8 ounces bacon, preferably thick-cut, chopped",
    "1 medium yellow onion",
    "2 cups well-drained napa cabbage kimchi",
    "1 tablespoon soy sauce",
    "1 cup frozen peas, thawed",
    "2 teaspoons toasted sesame oil",
    "4 scallions",
    "Kosher salt and ground black pepper",
    "4 large eggs",
    "Furikake seasoning (optional)",
    "Kitchen Equipment",
    "12” non-stick skillet",
    "Non-metal spatula",
    "Small Bowl and strainer",
    "Range",
    "Kitchen knife",
    "Liquid measuring cups",
    "Dry measuring cups"
  ],
  "instructions": [
    "Mise en Place:",
    "Measure, cook, and chill 2 cups of sushi rice.",
    "Measure 3¼ cups chilled, cooked sushi rice and put into a bowl.",
    "Measure 1 cup of frozen peas and defrost in a small bowl.",
    "Measure and roughly chop 6-8 ounces of Bacon and put in a small bowl.",
    "Chop 1 medium onion and put into small bowl",
    "Drain and Reserve 2 Tablespoons of juice from kimchi.",
    "Fully drain, measure and roughly chop 2 cups of the kimchi and put it in a bowl.",
    "Diagonally chop 4 scallions and put into a small bowl",
    "Measure 1½ Tablespoons of soy sauce and leave in a pourable container",
    "Measure 2 teaspoons of sesame oil and leave in a pourable container",
    "In a 12-inch nonstick skillet over medium, cook the bacon until well browned. 10 to 12 minutes.",
    "Scraping the pan, pour the bacon into the strainer fitted over a bowl:",
    "Reserve the bacon fat.",
    "Return 1 Tablespoon of the fat to the skillet, add the onion and cook over medium, stirring, until softened, 3 to 4 minutes.",
    "Stir in the rice and cook for 1 to 2 minutes.",
    "Drizzle the kimchi juice, soy sauce and 1 tablespoon of the bacon fat over the rice and stir to combine.",
    "Spread the rice in an even layer, increase heat to high and cook until browned on the bottom, about 3 minutes.",
    "Scrape along the bottom of the pan and flip the rice, then redistribute and cook until again browned on the bottom, another 2 to 3 minutes.",
    "Stir in the kimchi, bacon, peas, sesame oil and scallions.",
    "Cook, stirring, until hot, 1 to 2 minutes.",
    "Taste and season with salt and pepper.",
    "Transfer to a bowl and cover with foil.",
    "Wipe out the skillet with paper towels.",
    "Add 1 tablespoon of the bacon fat and heat over medium-high until barely smoking.",
    "Swirl to coat the pan, then crack an egg in each quadrant.",
    "Immediately reduce to medium-low and sprinkle with salt and pepper.",
    "Cook until the whites are set but the yolks are still runny, 2 to 3 minutes.",
    "Remove the pan from the heat.",
    "Serve the fried rice on individual plates. topped with a fried egg and sprinkled with furikake, if using."
  ],
  "dateAdded": "2025-12-05T17:17:09.662Z"
}