{
  "name": "Meatloaf",
  "category": "Meat",
  "description": "A classic comfort food made with ground beef and pork, mushrooms, and topped with a tangy ketchup glaze.",
  "prepTime": "15 minutes",
  "cookTime": "2 hours 20 minutes",
  "image": "",
  "ingredients": [
    "Meatloaf",
    "2 tablespoons butter",
    "1 onion",
    "6 ounces white mushrooms",
    "1 tablespoon tomato paste",
    "Almost 3/4 cup chicken broth (3 tablespoons plus 1/2 cup)",
    "1 Tablespoon garlic paste (or 2 garlic cloves)",
    "2 large eggs",
    "2 tablespoons soy sauce",
    "1 tablespoon unflavored gelatin",
    "1/2 slice hearty white sandwich",
    "2 teaspoons Dijon mustard",
    "3/4 teaspoon pepper",
    "1/2 teaspoon dried thyme",
    "1 pound ground pork",
    "1 pound 85% lean ground beef",
    "1/3 cup fresh parsley (optional)",
    "Glaze",
    "1/2 cup ketchup",
    "1/4 cup cider vinegar",
    "3 tablespoons packed brown sugar",
    "1 teaspoon Tabasco sauce",
    "1/2 teaspoon ground coriander",
    "Kitchen Equipment",
    "Heavy duty aluminum foil",
    "Half-sheet rimmed baking pan",
    "Half-sheet cooling rack",
    "Food processor",
    "Rubber spatula",
    "Meat thermometer",
    "12” skillet",
    "Small saucepan",
    "Medium bowl",
    "Large bowl",
    "Oven",
    "Kitchen knife",
    "Liquid measuring cups",
    "Dry measuring cups"
  ],
  "instructions": [
    "Mise en Place:",
    "Oven and Baking Sheet",
    "Set an oven rack to the middle of your oven",
    "Preheat oven to 350°",
    "Fold aluminium foil into a 9″ by 5″ rectangle. Put it in the center of a wire rack and use a paring knife OR FONDUE FORK  to poke about 1/2″ apart. Set rack in a rimmed baking sheet lined with foil (for easy cleanup).",
    "Meat",
    "Measure 1 pound ground beef into medium bowl.",
    "Measure 1 pound ground pork into beef bowl.",
    "Vegetables",
    "Measure 6 oz. of mushrooms.",
    "Thinly slice mushrooms and put in a medium bowl.",
    "Chop fine 1 onion and add to mushroom bowl.",
    "Measure out 1 Tablespoon of tomato paste.",
    "Mince ⅓ cup of parsley and put into small bowl.",
    "Measure 2 Teaspoons dijon mustard and add to parsley bowl.",
    "Measure ¾ Teaspoon pepper and add to parsley bowl.",
    "Measure ½ Teaspoon dried thyme adn to parsley bowl.",
    "Measure 1Tablespoon garlic paste (or crush and mince press 2 cloves garlic) into tiny bowl.",
    "The Rest",
    "Break 1 slice of white bread into 1 in. cubes and put into food processor",
    "Measure 1/2-cup chicken broth into a small bowl.",
    "Measure 2 Tablespoons soy sauce into chicken broth bowl.",
    "Add an egg to chicken broth bowl.",
    "Measure 1 Tablespoon unflavored gelatin in a tiny bowl.",
    "Measure 3 Tablespoons of chicken broth in a ramekin",
    "Meatloaf",
    "Range",
    "Put at 12″ skillet over medium burner and melt 2 Tablespoons of butter until the foaming begins to subside.",
    "Saute onions and mushrooms for 12 minutes until they begin to brown.",
    "Add in the tomato paste and continue cooking for 3 more minutes; stir constantly.",
    "Turn down burner to low.",
    "add garlic directly into the pan.",
    "Use small bowl of chicken broth to deglaze the pan.",
    "Cook for about 1 minutes then empty into a large bowl.",
    "Counter",
    "Whisk to combine ingredients in chicken broth bowl",
    "Sprinkle chicken broth bowl with unflavored gelatin.",
    "allow it to soften for 5 minutes.",
    "Food Processor",
    "Add bread cubes to food processor and pulse between 5 to 10 times.",
    "Add gelatin/egg mixture, onion/mushrooms, and parsley bowl into food processor.",
    "Pulse 10 more times until everything becomes finely ground.",
    "Empty into your large bowl (the one in which the onions cooled).",
    "Counter 2",
    "Add ground beef and ground pork to bowl.",
    "Combine thoroughly using your hands.",
    "Form into a 9″ by 5″ rectangle on the prepared half-sheet.",
    "Oven",
    "Bake for about 80 minutes until the internal temperature of the meat loaf reaches 160-degrees.",
    "Prepare glaze while meatloaf is cooking (See Below).",
    "Remove meatloaf tray from the oven.",
    "Preheat the broiler.",
    "Proceed to finishing.",
    "Glaze (Range 2)",
    "Measure ½ cup ketchup into small saucepan.",
    "Measure ¼ cup cider vinegar into small saucepan.",
    "Measure 3 Tablespoons packed brown sugar into small saucepan.",
    "Measure 1 teaspoon Tabasco sauce into small saucepan.",
    "Grind 1/2 teaspoon of coriander and put into small saucepan.",
    "Cook over medium heat for 5 minutes until it becomes thick.",
    "Divide in half",
    "Set aside until meatloaf finishes cooking in step 17.",
    "Finishing",
    "Use a rubber spatula to evenly cover the meatloaf with half the glaze.",
    "Broil for 2 minutes.",
    "When the glaze begins to bubble and brown, remove the meatloaf and evenly coat with the rest of the glaze.",
    "Broil for 2 more minutes, removing from broiler when the glaze begins to bubble and brown.",
    "Allow to cool for 10 minutes before slicing and serving."
  ],
  "dateAdded": "2025-12-05T17:19:26.765Z"
}