{
  "name": "Mexican Street Corn Salad (Esquites)",
  "category": "Vegetables",
  "description": "",
  "prepTime": "15 minutes",
  "cookTime": "Missing",
  "image": "",
  "ingredients": [
    "2 tablespoons vegetable oil",
    "3 cups corn kernels or 4 ears of corn",
    "Kosher salt",
    "2 tablespoons mayonnaise",
    "2 ounces feta cheese, finely crumbled",
    "½  scallion greens",
    "½  cup fresh cilantro",
    "1 jalapeño pepper",
    "2 medium cloves garlic",
    "1 tablespoon fresh juice from 1 lime",
    "Chili powder or hot chili flakes, to taste"
  ],
  "instructions": [
    "Mise en Place:",
    "Corn",
    "Measure 3 cups of corn and put in a medium bowl.",
    "Add 2 Tablespoons of vegetable oil to large non-stick pan on cooktop.",
    "Scallion Mixture",
    "Finely slice 1/2 cup of scallion greens and put in a large bowl.",
    "Finely chop 1/2 cup of fresh cilantro leaves and combine with the scallion greens in a large bowl.",
    "Seed and destem 1 jalapeño pepper.",
    "Finely chop the jalapeño and combine with the scallion mixture in a large bowl.",
    "Mince 2 medium garlic cloves to yield 1 to 2 teaspoons of minced garlic.",
    "Combine the garlic with the scallion mixture in the large bowl.",
    "Juice 1 lime and reserve 1 Tablespoon of juice in small ramekin.",
    "Combine the lime juice with the scallion mixture in the large bowl.",
    "Crumble 2 ounces of feta cheese and combine with scallions mixture in the large bowl.",
    "Measure 2 Tablespoons of mayonnaise and combine with the scallions mixture in the large bowl.",
    "Heat oil in a large non-stick skillet or wok over high heat until shimmering.",
    "Add corn kernels",
    "season to taste with salt, toss once or twice",
    "cook without moving until charred on one side, about 2 minutes.",
    "Toss corn, stir, and repeat until charred on second side, about 2 minutes longer.",
    "Continue tossing and charring until well charred all over, about 10 minutes total (2 minutes of char x5). Transfer to a large bowl.",
    "Add corn to scallion mixture and toss to combine.",
    "Taste and adjust seasoning with salt and more chili powder to taste. Serve immediately."
  ],
  "dateAdded": "2025-12-05T17:19:06.268Z"
}