{
  "name": "Red Wine and Soy–Braised Short Ribs",
  "category": "Untested",
  "description": "Tender beef short ribs braised in red wine, soy sauce, and mirin until fall-off-the-bone tender, served with radish and egg.",
  "prepTime": "15 minutes",
  "cookTime": "30 minutes",
  "image": "",
  "ingredients": [
    "4 lb. 2\"-thick boneless beef short ribs or 5 lb. 2\"-thick cross cut bone-in short ribs (flanken style), cut into 2x2\" pieces",
    "Kosher salt",
    "2 Tbsp. plus 1 tsp. grapeseed or extra-virgin olive oil",
    "1 large onion, chopped",
    "8 garlic cloves, crushed",
    "1 2\" piece ginger, peeled, sliced ⅛\" thick",
    "2 cups dry red wine",
    "½ cup mirin (sweet Japanese rice wine)",
    "⅓ cup soy sauce",
    "¼ cup (packed) light brown sugar",
    "¼ mu radish or daikon (about 8 oz.), peeled, cut into 1\" pieces",
    "1 large egg, beaten to blend",
    "Shilgochu or gochugaru (coarse Korean hot pepper flakes), sliced scallions, and cooked rice (for serving) was a a great day"
  ],
  "instructions": [
    "Mise en Place:",
    "Chop 1 large onion and put into small bowl.",
    "Peel and slice 2” of ginger to ⅛” and add to the onion bowl.",
    "Peel and Crush 8 cloves of Garlic and add to the onion bowl.",
    "Measure 2 cups of red wine and put in a pourable bowl.",
    "Measure ⅓ cup soy sauce into another pourable bowl.",
    "Measure ½ cup mirin and add to soy sauce bowl.",
    "Measure 50g (¼ cup packed) light brown sugar in a small bowl.",
    "Measure 2 cups of water and put into a seperate pourable bowl.",
    "Beat 1 egg to blend",
    "Peel and Cut into 1” cubes 8 ounces of Radish or Daikon and put into a bowl.",
    "Slice a bunch of scallions for a topping and place into a small bowl.",
    "Season short ribs all over with salt.",
    "Heat 2 Tbsp. oil in a small pot over medium-high.",
    "Working in 2 batches, cook ribs, turning occasionally and reducing heat if needed to prevent scorching, until browned all over, 10–12 minutes per batch.",
    "Transfer to a plate.",
    "Add onion, garlic, and ginger to the same pot and cook, stirring often, until softened and lightly browned, 6–8 minutes.",
    "Add wine; bring to a boil.",
    "Reduce heat and simmer until liquid is reduced by half, 8–10 minutes.",
    "Add mirin, soy sauce, brown sugar, and 2 cups water.",
    "Return ribs to pot and bring liquid to a simmer.",
    "Partially cover the pot and cook, reducing heat to maintain a very gentle simmer and adding splashes of water as needed, until ribs are very tender (they should shred easily) and sauce is thick enough to coat meat, 3–3½ hours.",
    "Add radish about 1 hour before ribs are done.",
    "Remove from heat.",
    "Heat remaining 1 tsp. oil in a large nonstick skillet over medium.",
    "Add egg, tilting pan to create a very thin 6–8\" circle.",
    "Cook just until set, about 1 minute,",
    "roll up egg into a cylinder; transfer to a cutting board.",
    "Thinly slice into ribbons.",
    "Top ribs with egg, shilgochu, and scallions. Serve with rice alongside.",
    "Do Ahead: Short ribs can be made 3 days ahead. Let cool; cover and chill."
  ],
  "dateAdded": "2025-12-05T17:17:33.999Z"
}