{
  "name": "Roasted Cauliflower with Sesame",
  "category": "Vegetables",
  "description": "",
  "prepTime": "15 minutes",
  "cookTime": "45 minutes",
  "image": "",
  "ingredients": [
    "1 head of cauliflower, broken by hand into bite-sized florets",
    "¼ cup olive oil",
    "2 teaspoons kosher salt",
    "1 teaspoon ground coriander",
    "1 teaspoon dried oregano",
    "freshly ground black pepper, to taste (I like to add a healthy amount of coarsely ground black pepper, personally)",
    "2 tablespoons tahini",
    "1 tablespoon white miso",
    "2 teaspoons red wine vinegar",
    "1½ tablespoons water",
    "3 tablespoons toasted white sesame seeds",
    "chili oil/paste, for serving (optional but recommended)",
    "Measure out and grind the coriander and pepper together. Reserve in ramekin",
    "Measure out the Salt and Oregano. Add to the coriander and pepper ramekin.",
    "Measure ¼ cup olive oil and put into a pourable small ramekin or beaker.",
    "Measure 2 Teaspoons red wine vinegar and 1½ Tablespoons of water and combine into a pourable small ramekin or beaker.",
    "Measure 2 Tablespoon Tahini and 1 Tablespoon White Miso and combine in a small bowl."
  ],
  "instructions": [
    "Mise en Place:",
    "Oven",
    "Preheat the oven to 450 degrees F and set aside.",
    "Cauliflower",
    "Break the cauliflower by hand into bite-sized florets",
    "Place the cauliflower in a large bowl and combine with the oil, salt, coriander, oregano, and pepper. Toss to combine.",
    "Line a baking sheet with parchment paper and spread the cauliflower out over it.",
    "Roast the cauliflower for about 10 minutes",
    "Turn the cauliflower and roast for about another 10 minutes",
    "While the cauliflower roasts, whisk together the tahini, miso, vinegar, and 1½ tablespoons of water in a small bowl. Set aside.",
    "When the cauliflower is roasted, move it to a large mixing bowl while it's still warm",
    "Toss the cauliflower with the sauce and sesame seeds.",
    "Serve immediately"
  ],
  "dateAdded": "2025-12-05T17:19:13.393Z"
}