{
  "name": "Sega Wat (Spicy Ethiopian Beef Stew)",
  "category": "Untested",
  "description": "A spicy Ethiopian beef stew cooked with berbere spices, niter kibbeh, and served with hard-boiled eggs.",
  "prepTime": "PREP TIME15 minutes",
  "cookTime": "TOTAL TIME1 hour 45 minutes",
  "image": "",
  "ingredients": [
    {
      "item": "2 pounds boneless beef chuck, cut into 1/2 inch cubes",
      "category": "Meat & Poultry"
    },
    {
      "item": "6 tablespoons niter kibbeh , divided",
      "category": "Other"
    },
    {
      "item": "3 cups chunky pureed onions (pulse in food processor to form a chunky paste)",
      "category": "Produce"
    },
    {
      "item": "1 1/2 tablespoons minced garlic",
      "category": "Produce"
    },
    {
      "item": "1 1/2 tablespoons minced fresh ginger",
      "category": "Produce"
    },
    {
      "item": "1/4 cup berbere spice blend",
      "category": "Other"
    },
    {
      "item": "Homemade Berbere Recipe ,HIGHLY recommended!",
      "category": "Other"
    },
    {
      "item": "1 1/2 teaspoons salt",
      "category": "Baking & Spices"
    },
    {
      "item": "1 cup strong beef broth",
      "category": "Meat & Poultry"
    },
    {
      "item": "4 hard-boiled eggs, shelled and pierced all over with a fork 1/4 inch deep (optional: traditionally added to doro wat, the chicken version of this stew; I like them in sega wat as well)",
      "category": "Meat & Poultry"
    }
  ],
  "instructions": [
    "Heat 3 tablespoons of niter kibbeh or butter in a heavy pot or Dutch oven. Add the onions and cook, covered, over low heat for 20 minutes, stirring occasionally.",
    "Add the garlic, ginger, and 1 tablespoon niter kibbeh and continue to cook for another 10 minutes, stirring occasionally.",
    "Add the berbere and the 2 remaining tablespoons of niter kibbeh and cook, covered, over low heat for another 10 minutes, stirring occasionally.",
    "Add the beef, broth, salt and bring to a boil. Reduce the heat to low, cover, and simmer for 45-60 minutes, or until the beef is tender, stirring occasionally.",
    "Adjust the seasonings, adding more berbere according to taste and heat preference. Add the hard-boiled eggs and simmer on low heat, covered, for another 10 to heat through.",
    "Half or quarter the eggs and arrange on the plates with the stew.  Serve hot with Ethiopian injera, bread or rice.",
    "*This stew is even better the next day after the flavors have had more time to meld."
  ],
  "dateAdded": "2025-12-05T17:17:29.801Z"
}
