{
  "name": "Thanksgiving Stuffing",
  "category": "Thanksgiving",
  "description": "",
  "prepTime": "15 minutes",
  "cookTime": "30 minutes",
  "image": "",
  "ingredients": [
    "¾ cup (1 ½ sticks) unsalted butter plus more for baking dish",
    "1 pound good-quality day-old white bread, torn into 1\" pieces (about 10 cups)",
    "2 ½ cups chopped yellow onions",
    "1 ½ cups celery",
    "½ cup chopped flat-leaf parsley",
    "2 tablespoons fresh sage",
    "1 tablespoon fresh rosemary",
    "1 tablespoon fresh thyme",
    "2 teaspoons kosher salt",
    "1 teaspoon freshly ground black pepper",
    "2 ½ cups low-sodium chicken broth",
    "2 large eggs"
  ],
  "instructions": [
    "Mise en Place:",
    "Vegetables",
    "Chop 2½ cups yellow onions",
    "¼“ Slice 1½ cups of celery",
    "Herbs",
    "Chop ½ cup of flat-leaf parsley and put in a small bowl.",
    "Chop 2 Tablespoons fresh sage and add it to the bowl.",
    "Chop 1 Tablespoon fresh thyme and add it to the bowl.",
    "Chop 1 Tablespoon fresh rosemary and add it to the bowl.",
    "Measure 2 teaspoons of salt and add it to the bowl.",
    "Measure 1 teaspoon ground black pepper and add it to the bowl.",
    "Chicken Broth",
    "Measure 2 ½  cups chicken broth.",
    "Divide chicken broth into two separate pourable containers.",
    "1 Day Prior to Serving",
    "Preheat oven to 250°F",
    "Butter a 13x9x2\" baking dish and set aside.",
    "Scatter bread in a single layer on a rimmed baking sheet.",
    "Bake, stirring occasionally, until dried out, about 1 hour. Let cool; transfer to a very large bowl.",
    "Meanwhile, melt 3/4 cup butter in a large skillet over medium-high heat.",
    "Add onions and celery. Stir often until just beginning to brown, about 10 minutes.",
    "Add to bowl with bread; stir in herbs, salt, and pepper.",
    "Drizzle in 1 1/4 cups broth and toss gently. Let cool.",
    "Preheat oven to 350°F.",
    "Whisk 1 1/4 cups broth and eggs in a small bowl. Add to bread mixture; fold gently until thoroughly combined.",
    "Transfer to prepared dish, cover with foil, and bake until an instant-read thermometer inserted into the center of dressing registers 160°F, about 40 minutes.",
    "Uncover; let cool.",
    "Cover; chill.",
    "Day of Cooking",
    "Bake dressing, uncovered, until set and top is browned and crisp, 50-55 minutes."
  ],
  "dateAdded": "2025-12-05T17:17:17.522Z"
}