{
  "chop": {
    "label": "Chop",
    "definition": "Cut ingredients into rough, similarly sized pieces using a knife.",
    "tips": "Keep your knife sharp and guide the blade with curled fingertips for safety.",
    "videoUrl": null
  },
  "dice": {
    "label": "Dice",
    "definition": "Cut ingredients into uniform cubes, typically small or medium in size.",
    "tips": "Square off the ingredient before slicing into planks, sticks, then cubes for consistency.",
    "videoUrl": null
  },
  "mince": {
    "label": "Mince",
    "definition": "Cut ingredients into very fine pieces for even distribution.",
    "tips": "Rock the knife tip while lifting the heel for fast mincing without bruising herbs.",
    "videoUrl": null
  },
  "julienne": {
    "label": "Julienne",
    "definition": "Slice ingredients into thin matchstick-like strips.",
    "tips": "Stack uniform planks before slicing to keep sticks even in thickness.",
    "videoUrl": null
  },
  "chiffonade": {
    "label": "Chiffonade",
    "definition": "Stack leafy greens, roll tightly, and slice into fine ribbons.",
    "tips": "Use a gentle sawing motion to avoid bruising delicate herbs like basil.",
    "videoUrl": null
  },
  "saute": {
    "label": "Sauté",
    "definition": "Cook quickly in a small amount of fat over medium-high heat while tossing.",
    "tips": "Preheat the pan and avoid overcrowding to prevent steaming.",
    "videoUrl": null
  },
  "sear": {
    "label": "Sear",
    "definition": "Brown the surface of food over high heat to develop flavor.",
    "tips": "Pat ingredients dry and leave undisturbed until a crust forms before flipping.",
    "videoUrl": null
  },
  "deglaze": {
    "label": "Deglaze",
    "definition": "Add liquid to a hot pan to dissolve browned bits and build a sauce.",
    "tips": "Remove the pan from heat momentarily to control sizzling, then scrape with a wooden spoon.",
    "videoUrl": null
  },
  "braise": {
    "label": "Braise",
    "definition": "Slow-cook ingredients partially submerged in flavorful liquid until tender.",
    "tips": "Sear first for flavor and keep the pot covered to trap steam.",
    "videoUrl": null
  },
  "roast": {
    "label": "Roast",
    "definition": "Cook food in a dry, hot oven with circulating air for caramelization.",
    "tips": "Use a preheated pan and space items apart so edges crisp.",
    "videoUrl": null
  },
  "broil": {
    "label": "Broil",
    "definition": "Cook food directly under intense top heat for quick browning.",
    "tips": "Keep food 4–6 inches from the element and watch closely to prevent burning.",
    "videoUrl": null
  },
  "poach": {
    "label": "Poach",
    "definition": "Gently cook food in barely simmering liquid just below boiling.",
    "tips": "Maintain water at 160–180°F to keep delicate items intact.",
    "videoUrl": null
  },
  "blanch": {
    "label": "Blanch",
    "definition": "Briefly boil ingredients, then shock in ice water to set color and texture.",
    "tips": "Salt the boiling water and prepare the ice bath before you start.",
    "videoUrl": null
  },
  "simmer": {
    "label": "Simmer",
    "definition": "Cook food gently in liquid with small, steady bubbles.",
    "tips": "Adjust heat so bubbles lazily break the surface instead of boiling vigorously.",
    "videoUrl": null
  },
  "reduce": {
    "label": "Reduce",
    "definition": "Cook liquid over heat to evaporate water and intensify flavor.",
    "tips": "Use a wide pan for faster evaporation and skim impurities as needed.",
    "videoUrl": null
  },
  "emulsify": {
    "label": "Emulsify",
    "definition": "Combine fat and water-based liquids into a stable mixture.",
    "tips": "Whisk constantly while slowly streaming in the fat to keep droplets suspended.",
    "videoUrl": null
  },
  "fold": {
    "label": "Fold",
    "definition": "Gently combine light and heavy mixtures without deflating air.",
    "tips": "Cut through the center, sweep around the bowl, and rotate until incorporated.",
    "videoUrl": null
  },
  "knead": {
    "label": "Knead",
    "definition": "Work dough by hand to develop gluten and structure.",
    "tips": "Push the dough away with the heel of your palm, fold it back, and repeat until smooth.",
    "videoUrl": null
  },
  "proof": {
    "label": "Proof",
    "definition": "Let yeast dough rest so it ferments and rises before baking.",
    "tips": "Cover dough to prevent drying and ferment in a warm, draft-free spot.",
    "videoUrl": null
  },
  "temper": {
    "label": "Temper",
    "definition": "Slowly equalize temperatures between ingredients to prevent curdling or shock.",
    "tips": "Add a little hot liquid to the cool ingredient while whisking, then return to the pot.",
    "videoUrl": null
  },
  "zest": {
    "label": "Zest",
    "definition": "Remove the colored outer peel of citrus for aromatic oils.",
    "tips": "Avoid the bitter white pith by using light pressure and rotating the fruit often.",
    "videoUrl": null
  },
  "grate": {
    "label": "Grate",
    "definition": "Shred ingredients into fine pieces using a grater or microplane.",
    "tips": "Use the right grate size for the ingredient and keep fingers tucked.",
    "videoUrl": null
  },
  "caramelize": {
    "label": "Caramelize",
    "definition": "Cook sugars until they brown and develop complex flavor.",
    "tips": "Use moderate heat, stir sparingly, and stop the cooking with a splash of liquid at the desired color.",
    "videoUrl": null
  },
  "whip": {
    "label": "Whip",
    "definition": "Beat ingredients rapidly to incorporate air and increase volume.",
    "tips": "Chill bowls and beaters for cream or egg whites to speed up whipping.",
    "videoUrl": null
  },
  "steam": {
    "label": "Steam",
    "definition": "Cook food with vapor from boiling liquid without direct contact.",
    "tips": "Keep water at a steady boil and avoid overcooking by checking doneness early.",
    "videoUrl": null
  },
  "smash": {
    "label": "Smash",
    "definition": "Press ingredients firmly to flatten or release juices and flavor.",
    "tips": "Use the side of a chef's knife or heavy-bottomed pan to crush items like garlic or cucumbers.",
    "videoUrl": null
  }
}
